cognitive-science.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-08-02 Mon 00:42 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Cognitive Science - digikar99.github.io</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="shubhamkar" />
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1.0, shrink-to-fit=no">
<link rel="stylesheet" type="text/css" href="others.css">
</head>
<body>
<div id="content">
<h1 class="title">Cognitive Science - digikar99.github.io</h1>
<div class="org-center">
<p>
<a href="index.html">Home</a> | <a href="common-lisp-and-emacs.html">Common Lisp and Emacs</a> | <a href="cognitive-science.html">Cognitive Science</a> | <a href="./digimon.html">Digimon</a>
</p>
</div>

<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org741ada5">1. Why Cognitive Science?</a></li>
<li><a href="#orge181142">2. Why Cognitive Science and not Neuroscience or Psychology?</a></li>
<li><a href="#org53c22b6">3. What are you working on / want to work upon?</a></li>
<li><a href="#orgeae6a3e">4. Learning Resources</a></li>
</ul>
</div>
</div>

<br>

<div id="outline-container-org741ada5" class="outline-2">
<h2 id="org741ada5">1. Why Cognitive Science?</h2>
<div class="outline-text-2" id="text-org741ada5">
<p>
I think, if understanding the universe was (one of) the hottest field in the past century or four, understanding the (human) brain will be (one of) the hottest field of this century.
</p>

<p>
Besides, even though our brains and minds and bodies are marvelous in certain aspects, they are miserable in some other aspects. Our bodies aren't the best instruments for venturing into outer space. Nor are our disconnected brains the best vessels in the digital age. Entire decades of experience are lost with the death of a human. It takes years to obtain mastery in specific fields.
</p>

<p>
But equally importantly, it will be amazing to be able to understand how a 100 billion neurons and a quadrillion synapses come together to form an entity who is reading this text. It is spooky to realize that in some cases, there can be not one you, but two or even multiple yous*. Or you can have multiple bodies with a single brain. Or you can cease to be conscious while you are sleeping. What. Is. Going. On.
</p>

<p>
Will we some day be able to recreate human minds with a computer? What would it take to do so? Why, even after so much data and efforts, are five-year olds still better conversationalists than something like the Google Assistant or Siri? What exactly would it take to learn language to a <i>human</i>-degree?
</p>

<p>
*No, I am not yet versed (let alone <i>well</i>-versed) with <a href="https://en.wikipedia.org/wiki/Dissociative_identity_disorder">Dissociative Identity Disorder</a>, or with <a href="https://en.wikipedia.org/wiki/Split-brain">Callosal Syndrome</a>, or with <a href="https://en.wikipedia.org/wiki/Craniopagus_twins">Craniopagus twins</a>
</p>
</div>
</div>

<div id="outline-container-orge181142" class="outline-2">
<h2 id="orge181142">2. Why Cognitive Science and not Neuroscience or Psychology?</h2>
<div class="outline-text-2" id="text-orge181142">
<p>
A rose is a rose whether one calls it an apple or a rose.
</p>

<p>
My current areas of interest include First Language Acquisition and Computational Cognitive Science and Consciousness - I'm yet to touch upon anything more than the former.
</p>

<p>
In the former, I've been able to touch upon 
</p>

<ul class="org-ul">
<li>Traditional Linguistics: Functional vs Chomskian, anyone?</li>
<li>Anthropology: To what extent is language a product of culture vs something inherent?</li>
<li>Machine Learning / Natural Language Processing: Word Vectors are great. In what way do they tie to our internal representations? (Nope, they aren't everything, since they do not incorporate <i>all of</i> common-sense.)</li>
<li>Neuroscience: Certain areas of the brain <i>do</i> affect language. Aphasia concerns with such linguistic disorders.</li>
</ul>

<p>
As such, we are <i>really</i> not sticking to any particular specific field in order to understand a phenomenon known as language. (And when you think of language, also think about nonverbal languages, such as the American Sign Language!)
</p>
</div>
</div>

<div id="outline-container-org53c22b6" class="outline-2">
<h2 id="org53c22b6">3. What are you working on / want to work upon?</h2>
<div class="outline-text-2" id="text-org53c22b6">
<p>
I started out with First Language Acquisition, but I have very recently got wrapped up in Computational Cognitive Science and Consciousness. I feel inclined towards Cognitive Architectures because we seem to acquire language in the context of an "internal world" rather than in "complete isolation". In addition, from an evolutionary perspective, Consciousness feels more primitive than Language.
</p>

<p>
I don't yet know what to make of this beyond these loose threads of thought.
</p>
</div>
</div>

<div id="outline-container-orgeae6a3e" class="outline-2">
<h2 id="orgeae6a3e">4. Learning Resources</h2>
<div class="outline-text-2" id="text-orgeae6a3e">
<ul class="org-ul">
<li>School Education (expected 2 dedicated years): <a href="https://alterschoolindia.com/">alterschoolindia</a>
<ul class="org-ul">
<li>Prerequisites: English, understanding of a 10/14 year old</li>
</ul></li>
<li>Computer Science (expected 2 dedicated years): <a href="https://teachyourselfcs.com/">teachyourselfcs.com</a>
<ul class="org-ul">
<li>Prerequisites: English, Mathematics from the above resource, understanding of a 16/18 year old</li>
</ul></li>
</ul>
</div>
</div>
</div>
</body>
</html>
